// pages/zwppDetail/gssz/zwppDetail.js
const CONFIG = require('../../../config');

Page({
  data: {
    isOpen: false,
    ads: [],
    searchData: null,
    search_result: [],
    datalist: [
      {
        "item01": 2020,
        "item02": "福建省人民防空办公室",
        "item03": "行政机关",
        "item04": "指挥通信处一级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "电子信息类、计算机科学与技术类",
        "item11": "",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "中国国民党革命委员会福建省委员会",
        "item03": "各民主党派和工商联",
        "item04": "办公室财务（一级主任科员以下）",
        "item05": "",
        "item06": 1,
        "item07": "无党派",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "会计与审计类",
        "item11": "从事财务工作相关经历2年及以上。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "中共福建省委宣传部",
        "item03": "中国共产党机关",
        "item04": "部机关四级主任科员及以下",
        "item05": "",
        "item06": 6,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "中国语言文学类、法学类、新闻传播学类、经济贸易类、哲学类（以上专业作为参考）",
        "item11": "具有文字综合工作相关经历，有宣传文化系统工作经历的优先。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "中共福建省委宣传部",
        "item03": "中国共产党机关",
        "item04": "省委文明办四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "中国语言文学类、法学类、政治学类（以上专业作为参考）",
        "item11": "具有文字综合工作相关经历（有文明办系统或宣传文化系统工作经历优先）。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省应急管理厅",
        "item03": "行政机关",
        "item04": "厅办公室二级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "不限",
        "item11": "从事综合文字工作相关经历2年及以上",
        "item12": "1.具有较好的综合文字和语言表达能力；2.有县级及以上党政机关工作经历者优先；3.该岗位需要经常加班，男性较合适。"
      },
      {
        "item01": 2020,
        "item02": "福建省应急管理厅",
        "item03": "行政机关",
        "item04": "厅应急指挥中心二级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "管理科学与工程类；电子信息类；通信信息类；计算机网络技术类；计算机信息管理类",
        "item11": "从事应急管理或信息化工作相关经历2年及以上",
        "item12": "1.具有较好的文字和语言表达能力；2.该岗位需要经常值班值守，处置突发事件，男性较适合。"
      },
      {
        "item01": 2020,
        "item02": "福建省应急管理厅",
        "item03": "行政机关",
        "item04": "政策法规处二级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "法学类",
        "item11": "",
        "item12": "取得法律职业资格或律师资格的优先。"
      },
      {
        "item01": 2020,
        "item02": "福建省应急管理厅",
        "item03": "行政机关",
        "item04": "人事处二级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "不限",
        "item11": "从事组织人事工作相关经历2年及以上。",
        "item12": "具有较好的文字综合能力。"
      },
      {
        "item01": 2020,
        "item02": "福建省药品监督管理局",
        "item03": "行政机关",
        "item04": "药械监管岗位二级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "药学类，生物医学工程、医疗产品管理、临床工程技术等医疗器械相关专业",
        "item11": "从事药品监管工作相关经历2年以上，具备省级及以上药械检查员资格",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省药品监督管理局",
        "item03": "行政机关",
        "item04": "政策法规处二级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "法学类",
        "item11": "具有法律职业资格",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省药品监督管理局",
        "item03": "行政机关",
        "item04": "综合处二级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "中国语言文学类",
        "item11": "具有文字综合岗位工作2年及以上经历。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省药品监督管理局",
        "item03": "行政机关",
        "item04": "厦门药品稽查办二级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "药学类，生物医学工程、医疗产品管理、临床工程技术等医疗器械相关专业",
        "item11": "药品监管工作相关经历2年以上，具备省级及以上药械检查员资格",
        "item12": "厦门药品稽查办办公地点在厦门（执行省直津补贴标准）。"
      },
      {
        "item01": 2020,
        "item02": "福建省药品监督管理局",
        "item03": "行政机关",
        "item04": "厦门药品稽查办二级主任科员及以下",
        "item05": "",
        "item06": 2,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "药学类，中药（学），临床医学",
        "item11": "药品监管工作相关经历2年以上，具备省级及以上药械检查员资格",
        "item12": "厦门药品稽查办办公地点在厦门（执行省直津补贴标准）。"
      },
      {
        "item01": 2020,
        "item02": "福建省住房和城乡建设厅",
        "item03": "行政机关",
        "item04": "城市管理处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "城市管理与监察，城市管理，公共事务管理，社会工作与管理，法学及相关专业",
        "item11": "",
        "item12": "从事城市管理、城市执法队伍建设、生活垃圾分类等相关工作，具有较高的综合文字能力，能适应经常性出差和加班"
      },
      {
        "item01": 2020,
        "item02": "中共福建省纪律检查委员会福建省监察委员会",
        "item03": "中国共产党机关",
        "item04": "文字综合（一级主任科员及以下）",
        "item05": "",
        "item06": 5,
        "item07": "中共党员",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "不限",
        "item11": "中共党员，不含预备党员；第一学历为全日制普通高等院校毕业，并取得相应学位。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "中共福建省纪律检查委员会福建省监察委员会",
        "item03": "中国共产党机关",
        "item04": "监督检查（一级主任科员及以下）",
        "item05": "",
        "item06": 5,
        "item07": "中共党员",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "不限",
        "item11": "中共党员，不含预备党员；第一学历为全日制普通高等院校毕业，并取得相应学位。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "中共福建省纪律检查委员会福建省监察委员会",
        "item03": "中国共产党机关",
        "item04": "省纪委监委一级主任科员及以下",
        "item05": "",
        "item06": 5,
        "item07": "中共党员",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "不限",
        "item11": "中共党员，不含预备党员；第一学历为全日制普通高等院校毕业，并取得相应学位；须在县级及以上党政机关或政法部门工作满3年的选调生。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "中共福建省纪律检查委员会福建省监察委员会",
        "item03": "中国共产党机关",
        "item04": "省纪委监委一级主任科员及以下",
        "item05": "",
        "item06": 5,
        "item07": "中共党员",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "不限",
        "item11": "中共党员，不含预备党员；第一学历为全日制普通高等院校毕业，并取得相应学位；须为县级及以上纪检监察机关在编在岗公务员，且从事纪检监察工作满3年。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省体育局",
        "item03": "行政机关",
        "item04": "机关处室一级主任科员及以下",
        "item05": "",
        "item06": 2,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "全日制普通高等院校",
        "item10": "政治学类、法学类、经济学类",
        "item11": "具有县级及以上机关2年以上文字综合工作经历。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省体育局",
        "item03": "行政机关",
        "item04": "机关处室一级主任科员及以下",
        "item05": "",
        "item06": 2,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "全日制普通高等院校",
        "item10": "政治学类、法学类、经济学类",
        "item11": "具有县级及以上机关2年以上文字综合工作经历。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省信访局",
        "item03": "行政机关",
        "item04": "办公室三级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "全日制普通高等院校",
        "item10": "哲学类、马克思主义理论类",
        "item11": "具有从事办公室工作2年及以上经历",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省工业和信息化厅",
        "item03": "行政机关",
        "item04": "综合处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "不限",
        "item10": "经济学类",
        "item11": "具有文字综合工作相关经历",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省工业和信息化厅",
        "item03": "行政机关",
        "item04": "法规和行政审批处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "法学类",
        "item11": "通过国家统一司法考试",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省工业和信息化厅",
        "item03": "行政机关",
        "item04": "计划财务处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "财务相关专业",
        "item11": "具有财务工作相关经历",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省工业和信息化厅",
        "item03": "行政机关",
        "item04": "产业协调处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "不限",
        "item10": "工学类",
        "item11": "",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省工业和信息化厅",
        "item03": "行政机关",
        "item04": "装备工业处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "不限",
        "item10": "安全工程类",
        "item11": "",
        "item12": "需要经常到基层出差开展民爆行业安全生产检查"
      },
      {
        "item01": 2020,
        "item02": "福建省工业和信息化厅",
        "item03": "行政机关",
        "item04": "新材料工业处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "不限",
        "item10": "材料类",
        "item11": "",
        "item12": "需要到基层一线开展新材料行业检查调研"
      },
      {
        "item01": 2020,
        "item02": "福建省工业和信息化厅",
        "item03": "行政机关",
        "item04": "石化工业处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "不限",
        "item10": "化工、安全管理相关专业",
        "item11": "",
        "item12": "需要经常到基层一线开展化工建设工程安装质量安全检查产相关工作"
      },
      {
        "item01": 2020,
        "item02": "福建省工业和信息化厅",
        "item03": "行政机关",
        "item04": "消费品工业处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "不限",
        "item10": "医药、生物工程、纺织相关专业",
        "item11": "",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省工业和信息化厅",
        "item03": "行政机关",
        "item04": "信息化推进处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "不限",
        "item10": "电子与信息类",
        "item11": "",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省工业和信息化厅",
        "item03": "行政机关",
        "item04": "生产服务业处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "不限",
        "item10": "不限",
        "item11": "具有生产服务业工作相关经历",
        "item12": "需要到基层一线指导调研推动相关行业发展"
      },
      {
        "item01": 2020,
        "item02": "福建省工业和信息化厅",
        "item03": "行政机关",
        "item04": "人事处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "计算机科学与技术类",
        "item11": "具有组织人事工作相关经历。",
        "item12": "需要经常加班"
      },
      {
        "item01": 2020,
        "item02": "福建省工业和信息化厅",
        "item03": "行政机关",
        "item04": "省信息产业工会四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "电子与信息类",
        "item11": "",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "中共福建省委党校(福建行政学院)",
        "item03": "参公事业单位",
        "item04": "办公室四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "不限",
        "item10": "哲学类、中国语言文学类、政治学类、法学类、马克思主义理论类。",
        "item11": "",
        "item12": "从事理论研究工作，应具备良好的政治素质，具有较强的理论研究能力。"
      },
      {
        "item01": 2020,
        "item02": "中共福建省委党校(福建行政学院)",
        "item03": "参公事业单位",
        "item04": "办公室四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "不限",
        "item11": "具有2年及以上县级及以上机关文字综合工作经历。",
        "item12": "从事文字综合工作，应具备良好的政治素质，较强的文字综合能力。"
      },
      {
        "item01": 2020,
        "item02": "中共福建省委党校(福建行政学院)",
        "item03": "参公事业单位",
        "item04": "组织人事处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "不限",
        "item11": "具有2年及以上县（区）级及以上组织或人事部门工作经历。",
        "item12": "从事组织人事工作，应具有较强的组织协调能力和文字综合能力。"
      },
      {
        "item01": 2020,
        "item02": "中共福建省委党校(福建行政学院)",
        "item03": "参公事业单位",
        "item04": "机关党委一级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "哲学类、中国语言文学类、历史学类、公共管理类、政治学类、法学类、马克思主义理论类。",
        "item11": "综合文字相关工作经历2年及以上。",
        "item12": "有较强的文字功底和组织协调能力。"
      },
      {
        "item01": 2020,
        "item02": "中共福建省委党校(福建行政学院)",
        "item03": "参公事业单位",
        "item04": "公务员培训处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "公共管理类、教育学类。",
        "item11": "综合文字相关工作经历2年及以上。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "中共福建省委党校(福建行政学院)",
        "item03": "参公事业单位",
        "item04": "科研与决策咨询处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "公共管理类、马克思主义理论类、政治学类。",
        "item11": "综合文字相关工作经历2年及以上。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "中共福建省委党校(福建行政学院)",
        "item03": "参公事业单位",
        "item04": "研究生工作处一级科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "中国语言文学类、马克思主义理论类、公共管理类、新闻传播学类。",
        "item11": "综合文字相关工作经历2年及以上。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "中共福建省委党校(福建行政学院)",
        "item03": "参公事业单位",
        "item04": "后勤服务处（基建处）一级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "经济贸易类、财政金融类、会计与审计类。",
        "item11": "综合文字相关工作经历2年及以上。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省高级人民法院",
        "item03": "审判机关",
        "item04": "办公室一级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "法学类、中国语言文学类、党史类专业",
        "item11": "各中级人民法院、厦门海事法院、平潭综合实验区人民法院和基层人民法院优秀选调生。",
        "item12": "文字综合岗位"
      },
      {
        "item01": 2020,
        "item02": "福建省高级人民法院",
        "item03": "审判机关",
        "item04": "办公室保密行政管理岗位",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "保密管理相关专业、法学类、中文类及文秘、计算机网络与安全管理专业。",
        "item11": "具有2年以上基层工作经历和2年的公务员身份，从事机要、保密或综合部门文字工作2年以上；是选调生的，必须符合选调生调动的最低年限要求；年度考核均为称职以上等次，未受过效能告诫和党纪政务处分，没有违纪违法行为；没有法律规定不得担任公务员或具有任职回避要求情形；试用期内的公务员（含参照公务员法管理的工作人员）和未达到遴选所规定的本县市区服务年限的不得报考；符合《福建省省级机关公开遴选公务员工作暂行办法》和省委组织部公告规定的其他条件；身体健康，能正常履行遴选职位工作职责，符合遴选公务员体检标准。",
        "item12": "一级主任科员及以下"
      },
      {
        "item01": 2020,
        "item02": "福建省高级人民法院",
        "item03": "审判机关",
        "item04": "司法行政装备管理处财务岗位",
        "item05": "",
        "item06": 1,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "财务管理专业",
        "item11": "第一学历必须为财务管理专业；具有2年以上基层工作经历和2年的公务员身份；是选调生的，必须符合选调生调动的最低年限要求; 年度考核均为称职以上等次，未受过效能告诫和党纪政务处分，没有违纪违法行为；没有法律规定不得担任公务员或具有任职回避要求情形；试用期内的公务员（含参照公务员法管理的工作人员）和未达到遴选所规定的本县市区服务年限的不得报考;符合《福建省省级机关公开遴选公务员工作暂行办法》和省委组织部公告规定的其他条件；身体健康，能正常履行遴选职位工作职责，符合遴选公务员体检标准。",
        "item12": "三级主任科员及以下"
      },
      {
        "item01": 2020,
        "item02": "福建省高级人民法院",
        "item03": "审判机关",
        "item04": "网络安全与信息化建设办公室网络安全岗位",
        "item05": "",
        "item06": 1,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "计算机网络与安全管理、网络安全、网络系统安全、信息网络安全、网络安全检查、信息安全、信息安全技术、信息安全工程、信息安全与网络管理专业",
        "item11": "取得国家大学英语六级证书或大学英语六级合格水平（425分以上）；具有2年以上基层工作经历和2年的公务员身份，从事信息安全、信息化相关工作2年以上；是选调生的，必须符合选调生调动的最低年限要求; 年度考核均为称职以上等次，未受过效能告诫和党纪政务处分，没有违纪违法行为；没有法律规定不得担任公务员或具有任职回避要求情形；试用期内的公务员（含参照公务员法管理的工作人员）和未达到遴选所规定的本县市区服务年限的不得报考；符合《福建省省级机关公开遴选公务员工作暂行办法》和省委组织部公告规定的其他条件；身体健康，能正常履行遴选职位工作职责，符合遴选公务员体检标准。",
        "item12": "一级主任科员及以下"
      },
      {
        "item01": 2020,
        "item02": "福建省高级人民法院",
        "item03": "审判机关",
        "item04": "机关干部处组织人事（工资福利）岗位",
        "item05": "",
        "item06": 1,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "不限",
        "item11": "具有2年以上基层工作经历和2年的公务员身份，从事组织人事的工资福利相关工作或财务相关工作2年以上；是选调生的，必须符合选调生调动的最低年限要求; 年度考核均为称职以上等次，未受过效能告诫和党纪政务处分，没有违纪违法行为；没有法律规定不得担任公务员或具有任职回避要求情形；试用期内的公务员（含参照公务员法管理的工作人员）和未达到遴选所规定的本县市区服务年限的不得报考；符合《福建省省级机关公开遴选公务员工作暂行办法》和省委组织部公告规定的其他条件；身体健康，能正常履行遴选职位工作职责，符合遴选公务员体检标准。",
        "item12": "一级主任科员及以下"
      },
      {
        "item01": 2020,
        "item02": "福建省高级人民法院",
        "item03": "审判机关",
        "item04": "法警总队法警岗位",
        "item05": "",
        "item06": 2,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "司法警务、侦查（察）学、刑事侦查（察）、刑事侦查技术，警察指挥与战术、经济犯罪侦查、警卫学、涉外警务、边防公安、公安（安全）保卫、国内安全保卫、公安学、公共安全管理、公安管理、警察管理、预审、治安（学、管理）、公安法制、警卫、监狱学、狱政管理、刑事执行、劳改管理、劳教管理、罪犯管教专业；",
        "item11": "担任警察职务满3年以上；具有2年以上基层工作经历和2年的公务员身份；是选调生的，必须符合选调生调动的最低年限要求；年度考核均为称职以上等次，未受过效能告诫和党纪政务处分，没有违纪违法行为；没有法律规定不得担任公务员或具有任职回避要求情形；试用期内的公务员（含参照公务员法管理的工作人员）和未达到遴选所规定的本县市区服务年限的不得报考；符合《福建省省级机关公开遴选公务员工作暂行办法》和省委组织部公告规定的其他条件；身体健康，能正常履行遴选职位工作职责，符合遴选公务员体检标准。",
        "item12": "三级主任科员及以下"
      },
      {
        "item01": 2020,
        "item02": "福建省科技厅",
        "item03": "行政机关",
        "item04": "成果转化处四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "全日制普通高等院校",
        "item10": "电子信息类、计算机科学与技术类",
        "item11": "",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省科技厅",
        "item03": "行政机关",
        "item04": "办公室四级主任科员",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "全日制普通高等院校",
        "item10": "理学、工学大类",
        "item11": "",
        "item12": "从事文秘、机要工作"
      },
      {
        "item01": 2020,
        "item02": "福建省财政厅",
        "item03": "行政机关",
        "item04": "一级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "财政金融类：财政（学）、金融学；会计与审计类：会计硕士、会计（学）、审计（学）、财务管理、注册会计师；经济贸易类：国民经济管理、投资经济、应用经济学（含国民经济学、区域经济学、发展经济学、产业经济学、数量经济学、劳动经济学）；计算机网络技术类。",
        "item11": "",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省财政厅",
        "item03": "行政机关",
        "item04": "一级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "财政金融类：财政（学）、金融学；会计与审计类：会计硕士、会计（学）、审计（学）、财务管理、注册会计师；经济贸易类：国民经济管理、投资经济、应用经济学（含国民经济学、区域经济学、发展经济学、产业经济学、数量经济学、劳动经济学）；计算机网络技术类。",
        "item11": "",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省公安厅",
        "item03": "公安机关",
        "item04": "交通警察总队一级警长或警务技术一级主管及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "中国语言文学类、公安学类",
        "item11": "1.具有基层工作经历2年及以上； 2.具有公安工作经历2年及以上； 3.从事综合文秘工作相关经历2年及以上； 4.招考范围面向全省设区市及以下公安机关和全省高速交警系统的一级主任科员、一级警长或警务技术一级主管及以下民警。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省公安厅",
        "item03": "公安机关",
        "item04": "交通警察总队一级警长或警务技术一级主管及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "法学类",
        "item11": "1.具有基层工作经历2年及以上； 2.从事公安法制工作相关经历2年及以上； 3.招考范围面向全省设区市及以下公安机关和全省高速交警系统的一级主任科员、一级警长或警务技术一级主管及以下民警。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省公安厅",
        "item03": "公安机关",
        "item04": "交通警察总队一级警长或警务技术一级主管及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "计算机软件类，计算机网络技术类，计算机信息管理类",
        "item11": "1.具有基层工作经历2年及以上； 2.具有公安工作经历2年及以上； 3.从事计算机软件编程、计算机网络管理、计算机数据库管理与维护工作关经历2年及以上； 4.招考范围面向全省设区市及以下公安机关和全省高速交警系统的一级主任科员、一级警长或警务技术一级主管及以下民警。",
        "item12": "主要从事交通管理相关大数据挖掘分析、计算机软件编程统计工作"
      },
      {
        "item01": 2020,
        "item02": "福建省公安厅",
        "item03": "公安机关",
        "item04": "经济犯罪侦查总队一级警长及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "侦查管理学、侦查学、经济犯罪侦查、经济侦查、公安学",
        "item11": "1.具有基层工作经历2年及以上； 2.具有公安侦查工作相关经历2年及以上； 3.招考范围面向全省设区市及以下公安机关和全省高速交警系统的一级主任科员、一级警长或警务技术一级主管及以下民警。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省公安厅",
        "item03": "公安机关",
        "item04": "刑事技术总队一级警长或警务技术一级主管及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "计算机软件类、计算机网络技术类、计算机信息管理类",
        "item11": "1.具有基层工作经历2年及以上； 2.在网安、科通、刑事技术、技侦或指挥中心等部门从事计算机专业工作相关经历2年及以上； 3.招考范围面向全省设区市及以下公安机关和全省高速交警系统的一级主任科员、一级警长或警务技术一级主管及以下民警。",
        "item12": "主要从事刑事技术取证工作"
      },
      {
        "item01": 2020,
        "item02": "福建省公安厅",
        "item03": "公安机关",
        "item04": "法制总队一级警长及以下",
        "item05": "",
        "item06": 2,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "法学类",
        "item11": "1.具有基层工作经历2年及以上； 2.从事公安法制或执法工作相关经历2年及以上； 3.招考范围面向全省设区市及以下公安机关和全省高速交警系统的一级主任科员、一级警长或警务技术一级主管及以下民警。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省公安厅",
        "item03": "公安机关",
        "item04": "机场公安局一级警长或警务技术一级主管及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "法学类； 公安学类",
        "item11": "1.具有基层工作经历2年及以上； 2.从事公安法制或执法工作相关经历2年及以上； 3.招考范围面向全省设区市及以下公安机关和全省高速交警系统的一级主任科员、一级警长或警务技术一级主管及以下民警。",
        "item12": "主要从事刑事执法监督、案件审核"
      },
      {
        "item01": 2020,
        "item02": "福建省公安厅",
        "item03": "公安机关",
        "item04": "机场公安局一级警长或警务技术一级主管及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "公安学类",
        "item11": "1.具有基层工作经历2年及以上； 2.从事交通管理工作相关经历2年及以上； 3.招考范围面向全省设区市及以下公安机关和全省高速交警系统的一级主任科员、一级警长或警务技术一级主管及以下民警。",
        "item12": "主要从事维护交通秩序、处理交通事故"
      },
      {
        "item01": 2020,
        "item02": "福建省公安厅",
        "item03": "公安机关",
        "item04": "机场公安局一级警长或警务技术一级主管及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "公安学类",
        "item11": "1.具有基层工作经历2年及以上； 2.从事治安管理工作相关经历2年及以上； 3.招考范围面向全省设区市及以下公安机关和全省高速交警系统的一级主任科员、一级警长或警务技术一级主管及以下民警。",
        "item12": "主要从事公共场所、危险物品等治安管理及治安案件办理"
      },
      {
        "item01": 2020,
        "item02": "福建省司法厅",
        "item03": "行政机关",
        "item04": "立法一处一级主任科员及以下",
        "item05": "",
        "item06": 4,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "全日制普通高等院校",
        "item10": "法学类",
        "item11": "国家统一法律职业资格证书（A证）。2年以上基层工作经历。",
        "item12": "从事立法等相关工作，需取得国家统一法律职业资格证书（A证）。"
      },
      {
        "item01": 2020,
        "item02": "福建省司法厅",
        "item03": "行政机关",
        "item04": "行政复议与应诉二处一级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "全日制普通高等院校",
        "item10": "法学类",
        "item11": "国家统一法律职业资格证书（A证）。2年以上基层工作经历。",
        "item12": "从事行政复议与应诉等相关工作，需取得国家统一法律职业资格证书（A证）。"
      },
      {
        "item01": 2020,
        "item02": "福建省司法厅",
        "item03": "行政机关",
        "item04": "办公室一级主任科员及以下",
        "item05": "",
        "item06": 3,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "不限",
        "item11": "面向全省基层监狱戒毒单位。2年以上基层工作经历。",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省司法厅",
        "item03": "行政机关",
        "item04": "规范性文件备案审查处一级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "全日制普通高等院校",
        "item10": "法学类",
        "item11": "国家统一法律职业资格证书（A证）。2年以上基层工作经历。",
        "item12": "从事规范性文件备案审查等相关工作，需取得国家统一法律职业资格证书（A证）。"
      },
      {
        "item01": 2020,
        "item02": "福建省司法厅",
        "item03": "行政机关",
        "item04": "立法三处一级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "研究生",
        "item09": "全日制普通高等院校",
        "item10": "法学类。",
        "item11": "国家统一法律职业资格证书（A证）。2年以上基层工作经历。",
        "item12": "从事立法等相关工作，需取得国家统一法律职业资格证书（A证）。"
      },
      {
        "item01": 2020,
        "item02": "福建省人民政府驻深圳办事处",
        "item03": "行政机关",
        "item04": "信息处一级科员",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "不限",
        "item10": "中国语言文学类、政治学类、公共管理类",
        "item11": "职务或职级为一级科员",
        "item12": "在深圳工作；主要从事政务信息采集、编辑等工作；有2年及以上工作经历或从事过信息类工作的，在同等条件下优先。"
      },
      {
        "item01": 2020,
        "item02": "福建省人民政府驻北京办事处",
        "item03": "行政机关",
        "item04": "秘书处一级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "不限",
        "item11": "文字综合工作相关经历2年及以上",
        "item12": "工作地点在北京"
      },
      {
        "item01": 2020,
        "item02": "福建省委统一战线工作部（省政府侨务办公室）",
        "item03": "中国共产党机关",
        "item04": "部机关四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "中国语言文学类、法学类、经济贸易类、哲学类",
        "item11": "",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省委统一战线工作部（省政府侨务办公室）",
        "item03": "中国共产党机关",
        "item04": "部机关四级主任科员及以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "中国语言文学类、法学类、经济贸易类、哲学类",
        "item11": "",
        "item12": ""
      },
      {
        "item01": 2020,
        "item02": "福建省水利厅",
        "item03": "行政机关",
        "item04": "业务处室一级主任科员以下",
        "item05": "",
        "item06": 2,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "水利水电工程、水文与水资源工程、水文学与水资源、水工结构工程、水利工程、水文与水资源、水利水电建筑工程、水利水电工程管理、农业水利技术、水土保持、水土保持与荒漠化防治",
        "item11": "公务员，文字综合能力较强，基层工作经验2年，并符合当地最低服务年限。",
        "item12": "博士年龄35周岁以下"
      },
      {
        "item01": 2020,
        "item02": "福建省水利厅",
        "item03": "行政机关",
        "item04": "综合处室一级主任科员以下",
        "item05": "",
        "item06": 1,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "中国语言文学类、法学类",
        "item11": "文字综合能力较强。",
        "item12": "博士年龄35周岁以下"
      },
      {
        "item01": 2020,
        "item02": "福建省监狱管理局",
        "item03": "行政机关",
        "item04": "文字综合职位（一级主任科员及以下）",
        "item05": "",
        "item06": 5,
        "item07": "不限",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "不限",
        "item11": "1.面向福建省监狱系统基层单位在编在岗人民警察。 2.基层工作经历满2年（含试用期），其中监狱工作满1年。",
        "item12": "试用期6个月"
      },
      {
        "item01": 2020,
        "item02": "福建省监狱管理局",
        "item03": "行政机关",
        "item04": "文字综合职位（一级主任科员及以下）",
        "item05": "",
        "item06": 4,
        "item07": "中共党员（含预备党员）",
        "item08": "本科及以上",
        "item09": "全日制普通高等院校",
        "item10": "不限",
        "item11": "1.面向福建省监狱系统基层单位在编在岗人民警察。 2.基层工作经历满2年（含试用期），其中监狱工作满1年。 3.任监狱单位监区分监区（含直附属机构）领导职务或科（处）室工作经历满1年。",
        "item12": "试用期6个月"
      }
    ]
  },
  // 生命周期函数--监听页面加载
  onLoad: function (options) {
    if (options.searchData) { //参数
      var searchData = JSON.parse(options.searchData);
      console.log(searchData);
      wx.setNavigationBarTitle({
        title: searchData.year + searchData.xueli + searchData.zhuanye + '详情',
      });
      searchData.limits = 500;
      this.setData({
        searchData: searchData,
      })
    }

    // this.getAdsData();
    this.inquire();
  },
  // 生命周期函数--监听页面显示
  onShow: function () { },

  // 获取广告
  getAdsData() {
    wx.request({
      url: CONFIG.getIndexPageDataAPI,
      data: {
        sort: wx.getStorageSync('entrance'),
      },
      success: res => {
        var str = res.data.substring(1, res.data.length - 1);
        var data = JSON.parse(str);
        // console.log(data.lists[0]);
        var ads = JSON.parse(data.lists[0].ad_2);
        this.setData({
          ads: ads,
        })
      }
    })
  },
  // 展开/收起
  openSwitch(e) {
    let currentId = e.currentTarget.dataset.id;
    let list = this.data.search_result;
    list.forEach(el => {
      if (el.id == currentId) {
        el.isOpen = !el.isOpen;
      } else {
        el.isOpen = false;
      }
    });
    this.setData({
      search_result: list,
    })
  },
  
  // 查询
  inquire() {
    wx.showLoading({
      title: '加载中',
      mask: true,
    });
    console.log(this.data.searchData);
    let year = this.data.searchData.year;
    let xueli = this.data.searchData.xueli;
    let zhuanye = this.data.searchData.zhuanye;
    
    console.log(year)
    console.log(xueli)
    console.log(zhuanye)

    let attr = [];
    console.log(this.data.datalist)
    this.data.datalist.forEach(function (obj, idx){
      if (time_include(year, obj.item01) && xuel_include(xueli, obj.item08) && professional_include(zhuanye, obj.item10)) {
        attr.push(obj)
      }
    })
    console.log(attr)

    // $.each(datalist, function (idx, obj) {
    //   if (this.time_include(time, obj.item01) && this.xuel_include(xueli, obj.item09) && this.professional_include(zhuanye, obj.item10)) {
    //     attr.push(obj)
    //   }
    // });
    this.setData({
      search_result: attr,
    })
    wx.hideLoading();
    // wx.request({
    //   url: CONFIG.getQinhuangdaoExamSearchResultAPI,
    //   data: this.data.searchData,
    //   success: res => {
    //     var data = JSON.parse(res.data.replace(/^(\s|\()+|(\s|\))+$/g, ''));
    //     console.log(data);
    //     if (data.status == 1) {
    //       wx.hideLoading();
    //       wx.showToast({
    //         title: data.msg,
    //         icon: 'success',
    //         duration: 1000,
    //       })
    //       data.lists.forEach(el => {
    //         el.isOpen = false;
    //       });
    //       this.setData({
    //         search_result: data.lists,
    //       })
    //       // wx.stopPullDownRefresh();
    //       // console.log(data.lists[0]);
    //     } else {
    //       wx.hideLoading();
    //       wx.showToast({
    //         title: data.msg,
    //         icon: 'none',
    //         duration: 1000,
    //       })
    //       setTimeout(function () {
    //         wx.navigateBack({
    //           delta: 1,
    //         })
    //       }, 1000);
    //     }
    //   }
    // })
  },
})

var time_include = function(item, target) {
  if (item == target) {
    return true
  } else {
    return false
  }
}
// 学历筛选
var xuel_include = function(item, target) {
  if (item == '专科') {
    if (target.indexOf('专科') != -1 || target.indexOf('大专') != -1 || target.indexOf('中专') != -1) {
      return true
    } else {
      return false
    }
  } else if (item == '本科') {
    if (target.indexOf('专科') != -1 || target.indexOf('大专') != -1 || target.indexOf('本科') != -1 || target.indexOf('中专') != -1 || target.indexOf('二本') != -1 || target.indexOf('一本') != -1) {
      return true
    } else {
      return false
    }
  } else if (item == '研究生') {
    return true
  }
}
// 专业筛选
var professional_include = function(item, target) {
  if (target.indexOf(item) != -1 || target.indexOf("不限") != -1) {
    return true
  } else {
    return false
  }
}